app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
 LIMIT 10
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori');

        if ($q !== '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id !== '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $artikel = $builder->paginate(10, 'default', $page);

INSERT INTO `artikel` (`judul`, `isi`, `slug`, `id_kategori`, `gambar`) VALUES ('Mendadak Kaya Devi dan Desta Keliling Dunia!', 'Waw', 'mendadak-kaya-devi-dan-desta-keliling-dunia', '4', '1752246815_a0e95ee9010916562eb2.jpg')
---
    public function add()
    {
        $validationRules = [
            'judul'       => 'required',
            'id_kategori' => 'required|integer',
            'gambar'      => [
                'label' => 'Gambar',
                'rules' => 'is_image[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]|max_size[gambar,2048]', // max 2MB
                'errors' => [
                    'is_image' => 'File yang diunggah harus gambar.',
                    'mime_in'  => 'Gambar harus berformat jpg, jpeg, atau png.',
                    'max_size' => 'Ukuran gambar maksimal 2MB.'
                ]
            ]
        ];

        if ($this->request->getMethod() == 'POST' && $this->validate($validationRules)) {
            $model = new ArtikelModel();

            // Tangani file gambar
            $gambar = $this->request->getFile('gambar');
            $namaGambar = null;

            if ($gambar && $gambar->isValid() && !$gambar->hasMoved()) {
                $namaGambar = $gambar->getRandomName(); // nama acak agar aman
                $gambar->move('uploads/artikel', $namaGambar); // Pastikan folder ini ada
            }

            // Simpan ke database
            $model->insert([
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'slug'        => url_title($this->request->getPost('judul'), '-', true),
                'id_kategori' => $this->request->getPost('id_kategori'),
                'gambar'      => $namaGambar // pastikan field ini ada di DB
            ]);

SELECT *
FROM `kategori`
---
            $kategoriModel = new KategoriModel();
            $data = [
                'title'    => 'Tambah Artikel',
                'kategori' => $kategoriModel->findAll(),

SELECT *
FROM `artikel`
WHERE `slug` = 'pengaruh-face-recognition-dalam-bidang-kecerdasan-buatan'
 LIMIT 1
SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `kategori`
---
    public function view($slug)
    {
        $artikelModel = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $data['artikel'] = $artikelModel->where('slug', $slug)->first();
        if (empty($data['artikel'])) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Artikel tidak ditemukan.');
        }

        $data['title'] = $data['artikel']['judul'];

        // Tambahkan data untuk sidebar
        $artikelModel->orderBy('id', 'DESC')->limit(5)->find();

        $data['kategori'] = $kategoriModel->findAll();